Repository: MahmoudNamNam/cv-platform
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: CV Platform
ar: منصة السيرة الذاتية

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

source: Register
ar: التسجيل

source: Dashboard
ar: لوحة التحكم

source: Upload CV
ar: رفع السيرة الذاتية

source: Student Dashboard
ar: لوحة تحكم الطالب

source: Company Dashboard
ar: لوحة تحكم الشركة

source: Admin Dashboard
ar: لوحة تحكم المدير

source: Browse Students
ar: تصفح الطلاب

source: Compare Students
ar: مقارنة الطلاب

source: Compare
ar: مقارنة

source: Profile
ar: الملف الشخصي

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: Enter your username
ar: أدخل اسم المستخدم

source: Enter your password
ar: أدخل كلمة المرور

source: Don't have an account?
ar: ليس لديك حساب؟

source: Register here
ar: سجل هنا

source: Email
ar: البريد الإلكتروني

source: Role
ar: الدور

source: Select a role
ar: اختر دوراً

source: Student
ar: طالب

source: Company
ar: شركة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Choose a username
ar: اختر اسم مستخدم

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Confirm your password
ar: أكد كلمة المرور

source: Already have an account?
ar: لديك حساب بالفعل؟

source: Login here
ar: سجل الدخول هنا

source: CV File
ar: ملف السيرة الذاتية

source: Supported formats
ar: الصيغ المدعومة

source: Maximum file size
ar: الحد الأقصى لحجم الملف

source: Your CV will be processed using AI to extract structured information.
ar: سيتم معالجة سيرتك الذاتية باستخدام الذكاء الاصطناعي لاستخراج المعلومات المنظمة.

source: Upload and Process CV
ar: رفع ومعالجة السيرة الذاتية

source: Your CV Profile
ar: ملفك الشخصي للسيرة الذاتية

source: Summary
ar: الملخص

source: Major
ar: التخصص

source: GPA
ar: المعدل التراكمي

source: Skills
ar: المهارات

source: Education
ar: التعليم

source: Experience
ar: الخبرة

source: Certifications
ar: الشهادات

source: Languages
ar: اللغات

source: Actions
ar: الإجراءات

source: Edit CV Profile
ar: تعديل ملف السيرة الذاتية

source: Upload New CV
ar: رفع سيرة ذاتية جديدة

source: View Public Profile
ar: عرض الملف الشخصي العام

source: No CV Profile Found
ar: لم يتم العثور على ملف سيرة ذاتية

source: Upload your CV to create your profile
ar: قم برفع سيرتك الذاتية لإنشاء ملفك الشخصي

source: All rights reserved
ar: جميع الحقوق محفوظة

source: Browse Other Students
ar: تصفح الطلاب الآخرين

source: CV Data Extracted Successfully
ar: تم استخراج بيانات السيرة الذاتية بنجاح

source: Review the information extracted from your CV
ar: راجع المعلومات المستخرجة من سيرتك الذاتية

source: File processed
ar: تم معالجة الملف

source: The following information was extracted from your CV and has been saved to your profile.
ar: تم استخراج المعلومات التالية من سيرتك الذاتية وتم حفظها في ملفك الشخصي.

source: Extracted Information
ar: المعلومات المستخرجة

source: Not found
ar: غير موجود

source: Go to Dashboard
ar: الذهاب إلى لوحة التحكم

source: Manage Users
ar: إدارة المستخدمين

source: User Management
ar: إدارة المستخدمين

source: All Users
ar: جميع المستخدمين

source: CV Profile
ar: ملف السيرة الذاتية

source: Yes
ar: نعم

source: No
ar: لا

source: Active
ar: نشط

source: Inactive
ar: غير نشط

source: View
ar: عرض

source: No users found
ar: لم يتم العثور على مستخدمين

source: User Details
ar: تفاصيل المستخدم

source: Back to Users
ar: العودة إلى المستخدمين

source: User Information
ar: معلومات المستخدم

source: Last Login
ar: آخر تسجيل دخول

source: Never
ar: أبداً

source: Edit User
ar: تعديل المستخدم

source: Back to User Details
ar: العودة إلى تفاصيل المستخدم

source: Edit User Information
ar: تعديل معلومات المستخدم

source: Username cannot be changed
ar: لا يمكن تغيير اسم المستخدم

source: Active Account
ar: حساب نشط

source: Inactive users cannot log in
ar: المستخدمون غير النشطين لا يمكنهم تسجيل الدخول

source: Save Changes
ar: حفظ التغييرات

source: Cancel
ar: إلغاء

source: No Other Students Found
ar: لم يتم العثور على طلاب آخرين

source: There are no other students with CV profiles yet.
ar: لا يوجد طلاب آخرون لديهم ملفات سيرة ذاتية بعد.

source: more
ar: المزيد

source: View Profile
ar: عرض الملف الشخصي

source: Welcome Back
ar: مرحباً بعودتك

source: Login to access your account
ar: سجل الدخول للوصول إلى حسابك

source: Create Account
ar: إنشاء حساب

source: Join our platform and showcase your skills
ar: انضم إلى منصتنا واعرض مهاراتك

source: Upload Your CV
ar: ارفع سيرتك الذاتية

source: Let AI extract your information automatically
ar: دع الذكاء الاصطناعي يستخرج معلوماتك تلقائياً

source: Extracted CV Data
ar: بيانات السيرة الذاتية المستخرجة

source: Full Name
ar: الاسم الكامل

source: Phone
ar: الهاتف

source: Not provided
ar: غير متوفر

source: Unknown
ar: غير معروف

source: N/A
ar: غير متوفر

source: Edit Profile
ar: تعديل الملف الشخصي

source: Edit Personal Information
ar: تعديل المعلومات الشخصية

source: Update Your Profile
ar: تحديث ملفك الشخصي

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Note
ar: ملاحظة

source: Username cannot be changed after registration.
ar: لا يمكن تغيير اسم المستخدم بعد التسجيل.

source: Update Your CV Information
ar: تحديث معلومات سيرتك الذاتية

source: Professional Summary
ar: الملخص المهني

source: Select Students to Compare
ar: اختر الطلاب للمقارنة

source: Select 2 or more students to compare
ar: اختر طالبين أو أكثر للمقارنة

source: No students with CV profiles available for comparison.
ar: لا يوجد طلاب لديهم ملفات سيرة ذاتية متاحة للمقارنة.

source: Comparing
ar: مقارنة

source: student(s)
ar: طالب/طلاب

source: Side-by-Side Comparison
ar: مقارنة جنباً إلى جنب

source: Criteria
ar: المعايير

source: Best
ar: الأفضل

source: Skills Count
ar: عدد المهارات

source: Experience Count
ar: عدد الخبرات

source: Education Count
ar: عدد المؤهلات التعليمية

source: Certifications Count
ar: عدد الشهادات

source: Overall Score
ar: النقاط الإجمالية

source: Compare Different Students
ar: مقارنة طلاب مختلفين

source: Filters
ar: المرشحات

source: GPA Range
ar: نطاق المعدل التراكمي

source: Min GPA
ar: الحد الأدنى للمعدل

source: Max GPA
ar: الحد الأقصى للمعدل

source: Skills (comma-separated)
ar: المهارات (مفصولة بفواصل)

source: Search
ar: بحث

source: Search by name, email, or summary
ar: ابحث بالاسم أو البريد الإلكتروني أو الملخص

source: Apply Filters
ar: تطبيق المرشحات

source: Clear Filters
ar: مسح المرشحات

source: Students Found
ar: الطلاب الموجودون

source: No Students Found
ar: لم يتم العثور على طلاب

source: Try adjusting your filters
ar: حاول تعديل المرشحات

source: Not a student account
ar: ليس حساب طالب

source: This profile belongs to a
ar: هذا الملف الشخصي ينتمي إلى

source: User account not found
ar: حساب المستخدم غير موجود

source: CV profile exists but user account is missing.
ar: ملف السيرة الذاتية موجود لكن حساب المستخدم مفقود.

source: Major not specified
ar: التخصص غير محدد

source: Student Profile
ar: الملف الشخصي للطالب

source: Successfully Extracted Information
ar: تم استخراج المعلومات بنجاح

source: Your CV has been processed and the following information was extracted:
ar: تم معالجة سيرتك الذاتية وتم استخراج المعلومات التالية:

source: Platform analytics and management
ar: تحليلات وإدارة المنصة

source: Total Students
ar: إجمالي الطلاب

source: Total Companies
ar: إجمالي الشركات

source: CV Profiles
ar: ملفات السيرة الذاتية

source: Average GPA
ar: متوسط المعدل التراكمي

source: Most Common Skills
ar: المهارات الأكثر شيوعاً

source: Majors Distribution
ar: توزيع التخصصات

source: No skills data available
ar: لا توجد بيانات مهارات متاحة

source: No majors data available
ar: لا توجد بيانات تخصصات متاحة

source: Admin Actions
ar: إجراءات المدير

source: Warning
ar: تحذير

source: Admin actions are permanent and cannot be undone.
ar: إجراءات المدير دائمة ولا يمكن التراجع عنها.

source: Django Admin Panel
ar: لوحة تحكم Django

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Delete User
ar: حذف المستخدم

source: Delete CV
ar: حذف السيرة الذاتية

source: Are you sure you want to delete this user?
ar: هل أنت متأكد من حذف هذا المستخدم؟

source: Are you sure you want to delete this CV profile?
ar: هل أنت متأكد من حذف ملف السيرة الذاتية هذا؟

source: Staff Status
ar: حالة الموظف

source: Superuser Status
ar: حالة المستخدم الفائق

source: Date Joined
ar: تاريخ الانضمام

source: View Full CV Profile
ar: عرض ملف السيرة الذاتية الكامل

source: No CV profile found for this user.
ar: لم يتم العثور على ملف سيرة ذاتية لهذا المستخدم.

source: Is Active
ar: نشط

source: User Detail
ar: تفاصيل المستخدم

source: User not available
ar: المستخدم غير متاح

source: Not specified
ar: غير محدد

source: e.g., Computer Science
ar: مثال: علوم الحاسوب

source: e.g., Python, JavaScript, Django
ar: مثال: Python، JavaScript، Django

source: Please select at least 2 students to compare
ar: يرجى اختيار طالبين على الأقل للمقارنة

source: Separate skills with commas
ar: افصل المهارات بفواصل

source: Enter each education entry on a new line
ar: أدخل كل مؤهل تعليمي في سطر جديد

source: Enter each experience entry on a new line
ar: أدخل كل خبرة في سطر جديد

source: Enter each certification on a new line
ar: أدخل كل شهادة في سطر جديد

source: Enter languages separated by commas
ar: أدخل اللغات مفصولة بفواصل

source: Enter skills separated by commas
ar: أدخل المهارات مفصولة بفواصل

source: Comma-separated skills
ar: مهارات مفصولة بفواصل

source: One entry per line
ar: مدخل واحد في كل سطر

source: Comma-separated languages
ar: لغات مفصولة بفواصل

source: Profile Completeness
ar: اكتمال الملف الشخصي

source: Complete your profile to increase visibility
ar: أكمل ملفك الشخصي لزيادة الرؤية

source: Your profile is ready. Companies can now discover your talents!
ar: ملفك الشخصي جاهز. يمكن للشركات الآن اكتشاف مواهبك!

source: Welcome back
ar: مرحباً بعودتك

source: Quick Actions
ar: إجراءات سريعة

source: Update your information
ar: حدّث معلوماتك

source: See how others see you
ar: انظر كيف يراك الآخرون

source: Explore other profiles
ar: استكشف الملفات الشخصية الأخرى

source: Experiences
ar: الخبرات

source: Kuwait University
ar: جامعة الكويت

source: Kuwait University CV Platform
ar: منصة جامعة الكويت للسيرة الذاتية

source: User Profile
ar: الملف الشخصي للمستخدم

source: Name
ar: الاسم

source: Member since
ar: عضو منذ

source: Admin
ar: مدير
